<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"dev","backend":"ceabcb55bf25ecd040038576f73dfc7a6264e55138f445b2bf8f7939fee5aaaf","plan_job_ref":"Job CICD for Splitrr Infra #26 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10655703952","plan_out_hash":"768974dbd9fe57a1fa8d483ae7f61343c47c184c492226582f0fda574f94440d","plan_hash":"1d1c4e1a902b4c75f9c65cea04b0d7049be92f8d66bda6a0fe33173fb08ea3af","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 7 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # module.ecs-ec2.aws_appautoscaling_policy.ecs_target_cpu will be created
+   resource "aws_appautoscaling_policy" "ecs_target_cpu" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "splitrr-dev-backend-ecs-ec2-cpu-policy"
+       policy_type        = "TargetTrackingScaling"
+       resource_id        = "***********************************************************"
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       target_tracking_scaling_policy_configuration {
+           disable_scale_in   = false
+           scale_in_cooldown  = 300
+           scale_out_cooldown = 300
+           target_value       = 80

+           predefined_metric_specification {
+               predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs-ec2.aws_appautoscaling_policy.ecs_target_memory will be created
+   resource "aws_appautoscaling_policy" "ecs_target_memory" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "splitrr-dev-backend-ecs-ec2-memory-policy"
+       policy_type        = "TargetTrackingScaling"
+       resource_id        = "***********************************************************"
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       target_tracking_scaling_policy_configuration {
+           disable_scale_in   = false
+           scale_in_cooldown  = 300
+           scale_out_cooldown = 300
+           target_value       = 80

+           predefined_metric_specification {
+               predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs-ec2.aws_appautoscaling_target.ecs_target will be created
+   resource "aws_appautoscaling_target" "ecs_target" {
+       arn                = (known after apply)
+       id                 = (known after apply)
+       max_capacity       = 1
+       min_capacity       = 1
+       resource_id        = "***********************************************************"
+       role_arn           = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"
+       tags_all           = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }

+       suspended_state (known after apply)
    }

  # module.ecs-ec2.aws_autoscaling_group.app_asg will be created
+   resource "aws_autoscaling_group" "app_asg" {
+       arn                              = (known after apply)
+       availability_zones               = (known after apply)
+       default_cooldown                 = (known after apply)
+       desired_capacity                 = 1
+       force_delete                     = false
+       force_delete_warm_pool           = false
+       health_check_grace_period        = 0
+       health_check_type                = "EC2"
+       id                               = (known after apply)
+       ignore_failed_scaling_activities = false
+       load_balancers                   = (known after apply)
+       max_size                         = 2
+       metrics_granularity              = "1Minute"
+       min_size                         = 1
+       name                             = (known after apply)
+       name_prefix                      = (known after apply)
+       predicted_capacity               = (known after apply)
+       protect_from_scale_in            = false
+       service_linked_role_arn          = (known after apply)
+       target_group_arns                = (known after apply)
+       vpc_zone_identifier              = [
+           "subnet-0976aa1e5727a1645",
+           "subnet-0d6f60a42ff1b4811",
        ]
+       wait_for_capacity_timeout        = "10m"
+       warm_pool_size                   = (known after apply)

+       launch_template {
+           id      = "lt-07553bd93472f3a5d"
+           name    = (known after apply)
+           version = "$Latest"
        }

+       mixed_instances_policy (known after apply)

+       tag {
+           key                 = "Creator"
+           propagate_at_launch = true
+           value               = "bibeklabh@lftechnology.com"
        }
+       tag {
+           key                 = "Name"
+           propagate_at_launch = true
+           value               = "splitrr-dev-backend-ecs-ec2-asg"
        }
+       tag {
+           key                 = "Project"
+           propagate_at_launch = true
+           value               = "Splitrr"
        }

+       traffic_source (known after apply)
    }

  # module.ecs-ec2.aws_ecs_capacity_provider.main will be created
+   resource "aws_ecs_capacity_provider" "main" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "splitrr-dev-backend-ecs-ec2-capacity-provider"
+       tags_all = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }

+       auto_scaling_group_provider {
+           auto_scaling_group_arn         = (known after apply)
+           managed_draining               = (known after apply)
+           managed_termination_protection = "DISABLED"

+           managed_scaling {
+               instance_warmup_period    = (known after apply)
+               maximum_scaling_step_size = 1
+               minimum_scaling_step_size = 1
+               status                    = "ENABLED"
+               target_capacity           = 100
            }
        }
    }

  # module.ecs-ec2.aws_ecs_cluster_capacity_providers.main will be created
+   resource "aws_ecs_cluster_capacity_providers" "main" {
+       capacity_providers = [
+           "splitrr-dev-backend-ecs-ec2-capacity-provider",
        ]
+       cluster_name       = "EC2-ECS-CLUSTER"
+       id                 = (known after apply)

+       default_capacity_provider_strategy {
+           base              = 1
+           capacity_provider = "splitrr-dev-backend-ecs-ec2-capacity-provider"
+           weight            = 100
        }
    }

  # module.ecs-ec2.aws_ecs_service.app will be created
+   resource "aws_ecs_service" "app" {
+       cluster                            = "arn:aws:ecs:us-east-1:949263681218:cluster/EC2-ECS-CLUSTER"
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       force_new_deployment               = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = (known after apply)
+       name                               = "splitrr-dev-backend-ecs-ec2-service"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags                               = {
+           "Name" = "splitrr-dev-backend-ecs-ec2-service"
        }
+       tags_all                           = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-backend-ecs-ec2-service"
+           "Project" = "Splitrr"
        }
+       task_definition                    = "arn:aws:ecs:us-east-1:949263681218:task-definition/splitrr-dev-backend-ecs-ec2-task-def:1"
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       capacity_provider_strategy {
+           base              = 1
+           capacity_provider = "splitrr-dev-backend-ecs-ec2-capacity-provider"
+           weight            = 100
        }

+       load_balancer {
+           container_name   = "splitrr-dev-backend-ecs-ec2-container"
+           container_port   = 3001
+           target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:949263681218:targetgroup/splitrr-dev-lb-lb-tg/49769ce467dad4e9"
#            (1 unchanged attribute hidden)
        }

+       network_configuration {
+           assign_public_ip = false
+           security_groups  = [
+               "sg-0e7ba780dc6d674c1",
            ]
+           subnets          = [
+               "subnet-0976aa1e5727a1645",
+               "subnet-0d6f60a42ff1b4811",
            ]
        }

+       ordered_placement_strategy {
+           field = "attribute:ecs.availability-zone"
+           type  = "spread"
        }
    }

  # module.ecs-ec2.aws_launch_template.ecs_launch_template will be updated in-place
!~  resource "aws_launch_template" "ecs_launch_template" {
        id                                   = "lt-07553bd93472f3a5d"
!~      image_id                             = "************************************************"
!~      latest_version                       = 1 -> (known after apply)
        name                                 = "splitrr-dev-backend-ecs-ec2-lt2024090116310588320000000b"
        tags                                 = {}
#        (16 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

Plan: 7 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #26](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10655703952)